In [80]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [81]:
data=pd.read_csv('loan_data_set.csv')
data

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [82]:
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [83]:
data.shape

(614, 13)

In [84]:
data.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [85]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [86]:
data.isnull().sum()*100/len(data)

Loan_ID              0.000000
Gender               2.117264
Married              0.488599
Dependents           2.442997
Education            0.000000
Self_Employed        5.211726
ApplicantIncome      0.000000
CoapplicantIncome    0.000000
LoanAmount           3.583062
Loan_Amount_Term     2.280130
Credit_History       8.143322
Property_Area        0.000000
Loan_Status          0.000000
dtype: float64

In [87]:
#handling the missing the values
data = data.drop('Loan_ID',axis=1)

In [88]:
columns=['Gender','Married','Dependents','LoanAmount','Loan_Amount_Term']

In [89]:
data=data.dropna(subset=columns)

In [90]:
data['Self_Employed'].mode()[0]

'No'

In [91]:
data.isnull().sum()*100/len(data)#we have successfully drop missing values which is <5%

Gender               0.000000
Married              0.000000
Dependents           0.000000
Education            0.000000
Self_Employed        5.424955
ApplicantIncome      0.000000
CoapplicantIncome    0.000000
LoanAmount           0.000000
Loan_Amount_Term     0.000000
Credit_History       8.679928
Property_Area        0.000000
Loan_Status          0.000000
dtype: float64

In [92]:
data['Self_Employed']=data['Self_Employed'].fillna(data['Self_Employed']).mode()[0]

In [93]:
data['Credit_History']=data['Credit_History'].fillna(data['Credit_History']).mode()[0]

In [94]:
data.isnull().sum()*100/len(data)

Gender               0.0
Married              0.0
Dependents           0.0
Education            0.0
Self_Employed        0.0
ApplicantIncome      0.0
CoapplicantIncome    0.0
LoanAmount           0.0
Loan_Amount_Term     0.0
Credit_History       0.0
Property_Area        0.0
Loan_Status          0.0
dtype: float64

In [95]:
##we successfully removed all the missing values

In [96]:
data.sample(5)

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
178,Male,Yes,1,Graduate,No,3750,0.0,116.0,360.0,1.0,Semiurban,Y
488,Male,Yes,2,Graduate,No,4583,2083.0,160.0,360.0,1.0,Semiurban,Y
304,Male,No,0,Graduate,No,4000,2500.0,140.0,360.0,1.0,Rural,Y
504,Male,Yes,0,Not Graduate,No,3814,1483.0,124.0,300.0,1.0,Semiurban,Y
523,Male,Yes,2,Graduate,No,7948,7166.0,480.0,360.0,1.0,Rural,Y

In [97]:
data['Dependents']=data['Dependents'].replace(to_replace='3+',value='4')

In [98]:
data['Dependents'].unique()

array(['1', '0', '2', '4'], dtype=object)

In [99]:
#Handling the categorical values

In [100]:
categorical_columns=['Gender','Married','Dependents','Education','Self_Employed','Property_Area','Loan_Status']

In [101]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [102]:
for col in categorical_columns:
    data[col]=le.fit_transform(data[col])

In [103]:
data.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,1,1,1,0,0,4583,1508.0,128.0,360.0,1.0,0,0
2,1,1,0,0,0,3000,0.0,66.0,360.0,1.0,2,1
3,1,1,0,1,0,2583,2358.0,120.0,360.0,1.0,2,1
4,1,0,0,0,0,6000,0.0,141.0,360.0,1.0,2,1
5,1,1,2,0,0,5417,4196.0,267.0,360.0,1.0,2,1

In [104]:
x=data.drop('Loan_Status',axis=1)
y=data['Loan_Status']

In [105]:
#feature scaling 
#In our table values are not in the same so we have to feature scaling
cols=['ApplicantIncome','CoapplicantIncome','LoanAmount','Loan_Amount_Term']

In [106]:
from sklearn.preprocessing import StandardScaler
st=StandardScaler()
data[cols]=st.fit_transform(data[cols])

In [107]:
data.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,1,1,1,0,0,-0.128694,-0.049699,-0.214368,0.279961,1.0,0,0
2,1,1,0,0,0,-0.394296,-0.545638,-0.952675,0.279961,1.0,2,1
3,1,1,0,1,0,-0.464262,0.229842,-0.309634,0.279961,1.0,2,1
4,1,0,0,0,0,0.109057,-0.545638,-0.059562,0.279961,1.0,2,1
5,1,1,2,0,0,0.011239,0.834309,1.440866,0.279961,1.0,2,1

In [108]:
from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score
from sklearn.metrics import accuracy_score

In [109]:
model_df={}
def model_val(model,x,y):
    x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)
    model.fit(x_train,y_train)
    y_pred=model.predict(x_test)
    print(f"{model} accuracy is {accuracy_score(y_test,y_pred)}")
    
    score=cross_val_score(model,x,y,cv=5)
    print(f"{model} avg cross val score is {np.mean(score)}")
    
    model_df[model]=round(np.mean(score)*100,2)

In [116]:
#logistic regression
from sklearn.linear_model import LogisticRegression
lr=LogisticRegression()
model_val(lr,x,y)

LogisticRegression() accuracy is 0.6936936936936937
LogisticRegression() avg cross val score is 0.7016216216216217

In [117]:
#svc 
from sklearn import svm
svm=svm.SVC()
model_val(svm,x,y)

SVC() accuracy is 0.6936936936936937
SVC() avg cross val score is 0.7016216216216217

In [118]:
#decision Tree classifier
from sklearn.tree import DecisionTreeClassifier
dt=DecisionTreeClassifier()
model_val(dt,x,y)

DecisionTreeClassifier() accuracy is 0.6126126126126126
DecisionTreeClassifier() avg cross val score is 0.6383128583128583

In [119]:
#randomforest
from sklearn.ensemble import RandomForestClassifier
rf=RandomForestClassifier()
model_val(rf,x,y)

RandomForestClassifier() accuracy is 0.6306306306306306
RandomForestClassifier() avg cross val score is 0.6780507780507781

In [120]:
#Gradient boosting
from sklearn.ensemble import GradientBoostingClassifier
gb=GradientBoostingClassifier()
model_val(gb,x,y)

GradientBoostingClassifier() accuracy is 0.7117117117117117
GradientBoostingClassifier() avg cross val score is 0.6653562653562654

In [115]:
model_df

{LogisticRegression(): 70.16,
 SVC(): 70.16,
 DecisionTreeClassifier(): 64.55,
 RandomForestClassifier(): 68.71,
 GradientBoostingClassifier(): 66.9}

In [121]:
#saving the model
import pickle

with open('logistic_regression_model.pkl','wb') as file:
    pickle.dump(lr,file)

In [124]:
with open('logistic_regression_model.pkl','rb') as file:
    k=pickle.load(file)

In [125]:
cy=k.predict([[1,1,1,0,0,4583,1508.0,128.0,360.0,1.0,0]])

C:\ProgramData\anaconda3\lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but LogisticRegression was fitted with feature names
  warnings.warn(

In [126]:
print(cy)

[1]